Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/schema2beans-omegat.tmx
Source language: en_us
Languages: pt_br

source: Schema-to-Beans Library
pt_br: Biblioteca Schema-to-Beans

source: Infrastructure
pt_br: Infra-estrutura

source: Library for representing XML as JavaBeans.
pt_br: Biblioteca para representar XML como JavaBeans.

source: XML data binding generator.
pt_br: Gerador de vínculação de dados XML.

source: This module is a library of support classes for generating beans corresponding to XML descriptors.
pt_br: Este módulo é uma biblioteca de classes de suporte para geração de beans correspondente aos descritores XML.

source: (wrong enum declaration)
pt_br: (declaração de enum errada)

source: Unknown type "{0}"
pt_br: Tipo "{0}" desconhecido

source: (more declaration than expected)
pt_br: (mais declaração que esperada)

source: Less declaration than expected: {0}
pt_br: Menos declaração que a esperada: {0}

source: Attribute declaration not complete or incorrect
pt_br: Declaração de atributo incompleto ou incorreto

source: character | should be used with enum
pt_br: caractere | deve ser usado com enum

source: failed parsing the ATTLIST {0} - {1}
pt_br: falha analisando o ATTLIST {0} - {1}

source: Cannot create two different properties with the same name on the same bean.
pt_br: Não pode criar duas propriedades diferentes com o mesmo nome no mesmo bean.

source: The bean {0} has no property named {1}.
pt_br: O bean {0} não tem propriedade nomeada {1}.

source: Unknown property name: {0}
pt_br: Nome de propriedade desconhecida: {0}

source: Cannot write the tree as an XML stream: the bean is not attached to a DOM tree.
pt_br: Não pode escrever a árvore como um fluxo XML: o bean não está anexado à uma árvore DOM.

source: Failed to instanciate a bean: {0}
pt_br: Falha ao instanciar um bean: {0}

source: merger/mergee are not of the same class type: {0}/{1}
pt_br: merger/mergee não são do mesmo tipo de classe: {0}/{1}

source: The property {0} is not a bean.
pt_br: A propriedade {0} não é um bean.

source: Detected in createAttribute, the beanProp is null for "{0}".
pt_br: Detectado em createAttribute, o beanProp é nulo para "{0}".

source: It seems that createRoot hasn't been called yet.
pt_br: Parece que createRoot não foi chamado ainda.

source: Error: the schema object graph is null.
pt_br: Erro: o gráfico do objeto do esquema é nulo.

source: Failed to create the file "{0}", Exc: {1}.
pt_br: Falha criando arquivo "{0}", Exc: {1}.

source: Failed to read the metaDD file "{0}"
pt_br: Falha lendo arquivo metaDD "{0}"

source: Cannot create the directory "{0}" (already exists as a file).
pt_br: Não pôde criar o diretório "{0}" (já existe como um arquivo).

source: Renamed property from "{0}" to "{1}" in "{2}", due to duplicate names or a forbidden name.
pt_br: Propriedade renomeada de "{0}" para "{1}" em "{2}", nome duplicado ou nome não permitido.

source: Using the mdd information from {0}
pt_br: Utilizando a informação mdd de {0}

source: Created directory {0}
pt_br: Diretório {0} criado

source: The root element is ''{0}'' and its class is ''{1}''.
pt_br: O elemento root é ''{0}'' e sua classe é ''{1}''.

source: Skipping generation due to generated files are newer than source files.
pt_br: Ignorando geração devido à arquivos gerados mais novos que arquivos de origem.

source: No changes made to file.
pt_br: Nenhuma alteração feita no arquivo.

source: Bad token ''{0}'' in finder expression.
pt_br: Símbolo ruim ''{0}'' na expressão do localizador.

source: Missing "on" expression in finder ''{0}''.
pt_br: Faltando expressão "on" no localizador ''{0}''.

source: Unable to find expression from finder, ''{0}''.
pt_br: Impossível encontrar expressão do localizador, ''{0}''.

source: Parent node should not be null.
pt_br: Nó pai não pode ser nulo.

source: Not an indexed property
pt_br: Sem uma propriedade indexada

source: Cannot add a null value
pt_br: Não pode adicionar um valor nulo

source: Invalid index value for a single type property
pt_br: Valor do índice inválido para um único tipo de propriedade

source: Cannot insert an element which is already part of a graph.
pt_br: Não pôde inserir um elemento o qual já faz parte de um gráfico.

source: The element should be cloned first.
pt_br: O elemento deve ser fechado primeiro.

source: Unknown attribute {0} for property {1}
pt_br: Atributo {0} desconhecido para propriedade {1}

source: Cannot change a #FIXED attribute.
pt_br: Não pode alterar um atributo #FIXED.

source: The specified value ({0}) does not match one of the enumerated values: {1}
pt_br: O valor especificado ({0}) não combina com um dos valores enumerados: {1}

source: Not implemented yet
pt_br: Não implementado ainda

source: The change for property "{1}" has been vetoed.
pt_br: A alteração para a propriedade "{1}" foi vetada.

source: The property "{0}" has not been generated to support vetoable exceptions.
pt_br: A propriedade "{0}" não foi gerado para suportar exceções vetáveis.

source: Node already referenced: {0}
pt_br: Nó já referenciado: {0}

source: Property "{0}" already bound to a DOM node.
pt_br: Propriedade "{0}" já limitado para um nó DOM.

source: DD creation failed: {0}
pt_br: Criação DD falhou: {0}

source: Failed to find a bean class for the root element: {0}
pt_br: Falha ao encontrar uma classe bean para o elemento root: {0}

source: Failed to get the contructor
pt_br: Falha para obter o construtor

source: Failed to instanciate the bean class: {0}
pt_br: Falha para instanciar a classe bean: {0}

source: DDParser cannot use a key name without value: {0}
pt_br: DDParser não pode utilizar um nome de chave sem valor: {0}

source: "{0}" is a final property but has not been declared at the end of the parsing String.
pt_br: "{0}" é uma propriedade final mas não foi declarada no final da String analisada.

source: "{0}" not found in the property list: {1}
pt_br: "{0}" não encontrado na lista de propriedade: {1}

source: Bean graph {0} is already in the registry
pt_br: Gráfico do bean {0} já está no registro

source: Cannot register the graph {0} in the registry because the graph {1} is registered with the same ID: {2}
pt_br: Não pode registrar o gráfico {0} no registro porque o gráfico {1} está registrado com o mesmo ID: {2}

source: Cannot update the graph named {0} because it has not been found in the registry
pt_br: Não pode atualizar o gráfico chamado {0} porque não foi encontrado no registro

source: Bean graph "{0}" entry not found in the registry
pt_br: Entrada "{0}" do gráfico do bean não encontrada no registro

source: Graph name cannot be null
pt_br: Nome do gráfico não pode ser nulo

source: Cannot nest brace-evaluation declaration
pt_br: Não pode aninhar a declaração brace-evaluation

source: Cannot resolve {0} because there is no parent
pt_br: Não pode resolver {0} porque não há pai

source: The parsing path specified ({0}) doesn''t resolve to a graph node element.
pt_br: O caminho de análise especificado ({0}) não identifica um elemento de nó do gráfico.

source: Found {1}/{2} instead.
pt_br: Encontrado {1}/{2} ao invés.

source: No element found, path {0}
pt_br: Nenhum elemento encontrado, caminho {0}

source: No root found for path {0}
pt_br: Nenhum root encontrado para o caminho {0}

source: Cannot find a root for the parser (absolute path specified without parent graph)
pt_br: Não pôde encontrar uma raiz para o analisador (caminho absoluto especificado sem gráfico pai)

source: No parent specified
pt_br: Nenhum pai especificado

source: No root specified for {0}
pt_br: Nenhuma raiz especificada para {0}

source: Cannot access the BaseBean node specified by {0}
pt_br: Não pode acessar o nó BaseBean especificado por {0}

source: The wrapper class "{0}" specified for the property "{1}" has no String constructor and doesn''t implement the Wrapper interface.
pt_br: A classe empacotadora "{0}" especificada para a propriedade "{1}" não tem construtor String e não implementa a interface Wrapper.

source: Failed to instantiate an object of class "{0}" for property "{1}" using its String constructor with the value "{2}" : {3}
pt_br: Falha ao instanciar um objeto da classe "{0}" para a propriedade "{1}" utilizando seu construtor String com o valor "{2}" : {3}

source: Type not supported ... {0} type: {1}
pt_br: Tipo não suportado ... {0} tipo: {1}

source: DOMBinding already has a Node ({0}) - cannot sync the tree
pt_br: DOMBinding já tem um Nó ({0}) - não pode sincronizar a árvore

source: Unknown action: {0}
pt_br: Ação desconhecida: {0}

source: {0} filename not specified
pt_br: Nome do arquivo {0} não especificado

source: {0} handler not specified
pt_br: Manipulador {0} não especificado

source: InputStream should not be null
pt_br: InputStream não pode ser nulo

source: Couldn''t find the factory - try specifying a Document as the node value for the createGraph() method call.
pt_br: Não pôde encontrar a fábrica - tente especificar um Document como o valor de nó para a chamada do método createGraph().

source: Failed to get the Document
pt_br: Falha ao obter o Document

source: Failed to create the XML-DOM Document.
pt_br: Falha ao criar o XML-DOM Document.

source: Check your XML to make sure it is correct.
pt_br: Verifique o XML para ter certeza que ele está correto.

source: The current node has no binding: {0}
pt_br: O nó atual não tem vínculo: {0}

source: The name {0} should start with a /
pt_br: O nome {0} deve começar com um /

source: Cannot find the specified bean because in the bean "{0}", part of the bean name "{1}" has been removed.
pt_br: Não pôde encontrar o bean especificado porque no bean "{0}", parte do nome do bean "{1}" foi removido.

source: Cannot find the bean "{0}" within "{1}" - it might have been removed.
pt_br: Não pôde encontrar o bean "{0}" dentro do "{1}" - ele pode ter sido removido.

source: Unknown type: ''{0}''.
pt_br: Tipo desconhecido: ''{0}''.

source: Failed to create a new DOM root for ''{0}''!
pt_br: Falha ao criar uma nova raiz DOM para ''{0}''!

source: DOM graph creation failed: {0}
pt_br: Criação do gráfico DOM falhou: {0}

source: Doc root ''{0}'' not found in the DOM graph!
pt_br: Doc root ''{0}'' não encontrado no gráfico do DOM!

source: Found ''{1}'' instead.
pt_br: Encontrado ''{1}''.

source: The element ''{0}'' of type {1} has no value.
pt_br: O elemento ''{0}'' do tipo {1} não tem valor.

source: Duplicate element in parsed schema: ''{0}''.
pt_br: Elemento duplicado no esquema analisado: ''{0}''.

source: No elements found as candidates for root element.
pt_br: Nenhum elemento encontrado como candidato para elemento raiz.

source: Found node not referenced from root: ''{0}''.
pt_br: Nó encontrado não referenciado da raiz: ''{0}''.

source: Schema is not valid.
pt_br: Esquema não é válido.

source: A {0} is not allowed to contain a {1}: "{2}".
pt_br: Um {0} não permite conter um {1}: "{2}".

source: Duplicate element name, ''{0}'', at the same level in the schema is not allowed.
pt_br: Nome de elemento duplicado, ''{0}'', no mesmo nível no esquema não é permitido.

source: Two elements have the same name, ''{0}'', but different contents.
pt_br: Dois elementos tem o mesmo nome, ''{0}'', mas conteúdos diferente.

source: Trying to call ''{0}'' on ''{1}''.
pt_br: Tentando chamar ''{0}'' em ''{1}''.

source: Failed to find XML Schema type for ''{0}''.
pt_br: Falha ao encontrar tipo de Esquema XML para ''{0}''.

source: Invalid value, ''{0}'', for whiteSpace node.
pt_br: Valor inválido, ''{0}'', para nó whiteSpace.

source: Failed to parse document at ''{0}''.
pt_br: Falha ao analisar documento em ''{0}''.

source: Unable to find definition for type ''{0}''.
pt_br: Impossível encontrar definição para tipo ''{0}''.

source: Expected node ''{0}'', but found ''{1}''.
pt_br: Nó esperado ''{0}'', mas encontrado ''{1}''.

source: Failed to find ref ''{0}'' from ''{1}''.
pt_br: Falha ao encontrar ref ''{0}'' de ''{1}''.

source: ''{0}'' is not a good value for type ''{1}''.
pt_br: ''{0}'' não é um bom valor para o tipo ''{1}''.

source: Bad time/date parse of ''{0}''.
pt_br: Análise de hora/data ruim para ''{0}''.

source: Skipping generation of class (as specified in the mdd file).
pt_br: Geração da classe ignorada (como especificado no arquivo mdd).

source: Warning: Unable to find referred to {0}, ''{1}''.
pt_br: Aviso: Impossível encontrar menção {0}, ''{1}''.

source: Generating class {0}
pt_br: Gerando classe {0}

source: Nothing to compile.
pt_br: Nada à compilar.

source: Compiling....
pt_br: Compilando....

source: Unable to compile due to:
pt_br: Impossível compilar devido à:

source: Illegal name of schema, ''{0}''.
pt_br: Nome ilegal de esquema, ''{0}''.

source: It must be ''XMLSchema'' or ''DTD''.
pt_br: Deve ser ''XMLSchema'' ou ''DTD''.
